masarray/arstack61850/embedded/esp32p4_smv_injector/sdkconfig.defaults
# ARStack ESP32-P4-ETH SMV Injector defaults.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_AR_SMV_LIVE_TX=y
CONFIG_AR_SMV_P2_REALTIME_50HZ=y
CONFIG_AR_SMV_CANONICAL_VLAN=y
CONFIG_AR_SMV_BROADCAST_MIRROR=y
# CONFIG_AR_SMV_DIAGNOSTIC_PROBES is not set
CONFIG_AR_SMV_CURRENT_RMS_MA=1000
CONFIG_AR_SMV_VOLTAGE_RMS_MV=57740
